package com.lee.ttest.bean;

import java.io.Serializable;
import java.util.List; /**
 * @类名: ${type_name}
 * @功能描述:
 * @作者: ${user}
 * @时间: ${date}
 * @最后修改者:
 * @最后修改内容:
 */
public class QSTextBean implements Serializable {

    /**
     * showapi_res_error : 
     * showapi_res_code : 0
     * showapi_res_body : {"allPages":437,"ret_code":0,
     * "contentlist":[{"text":"悟空打死了白骨精，使出现出原型\u2014\u2014一堆白骨！\r\n八戒见了，忙上去狠狠地补刀，铸了一钯又一钯。\r\n悟空见了：八戒，她跟你有仇？\r\n
     * 八戒：没有！可凭什么大家都是妖怪，她就可以瘦得剩下骨头，我却要这么胖！！\r\n","title":"悟空打死了白骨精，使...","type":1,"ct":"2018-02-12 10:00:03.257"},
     * {"text":"玩网游认识的她，苍白清秀的小脸我见犹怜。于是我帮了她几次，没想到她就赖上我了，升级我带，装备我提供。一次我问她:\u201c你欠我这么多怎么还呀？\u201d，她说:\u201c嫁给你呗！\u201d
     * 有一天她消失了，半个月后我找到她家，望着墓碑上的小脸，说:\u201c小骗子，你答应嫁给我的啊！\u201d后来听她朋友说，\u201c他为了你去泰国做手术，却没挺过来。\u201d","title":"却没挺过来",
     * "type":1,"ct":"2018-02-12 10:00:03.074"},{"text":"上语文课时，老师听写，当写到狼狈为奸时，我不会写\u201c狈\u201d字，于是瞄了一眼同桌的，他写的是狼被围奸。",
     * "title":"狼狈为奸","type":1,"ct":"2018-02-12 10:00:03.072"},
     * {"text":"回家就被催婚，相亲十几次无果。在我感觉生命中已经没有盼头的时候，白马王子出现了，俩人一见如故，聊得不亦乐乎。后来去他家，连上wifi
     * 我假装不懂让他帮我下载一个手游，他让我自己下。我娇滴滴的说：人家不会下载嘛！\u201d话音刚落，他妈妈说：我家就这一个儿子，我还想着早点抱孙子呢！没想到，你\u2026\u2026你走吧！我求你了。\u201d
     * 还没说完呢噗通一声跪我面前","title":"下载","type":1,"ct":"2018-02-12 10:00:03.068"},
     * {"text":"餐馆吃饭，隔壁桌有俩老外。胖胖的老外看到墙上有一个倒着贴的\u2018福\u2019字不太理解。\r\n另一个头发卷卷的老外就跟他解释：\u201c折个字，在粽国是很流行的！\u201d\r\n
     * 胖胖老外一脸很佩服的表情听着，头发卷卷的老外很认真的接着说：\u201c折个，就叫做倒\u2018逼\u2019\u201d","title":"餐馆吃饭，隔壁桌有俩...","type":1,
     * "ct":"2018-02-12 09:30:02.854"},{"text":"第一次做饭，拍了几张照片，发了个朋友圈...结果被亲朋好友各种点赞，好评不断...只有老妈絮叨的留言道：\u201c
     * 别忘了关煤气...\u201d","title":"煤气","type":1,"ct":"2018-02-12 09:30:02.662"},
     * {"text":"老公打来电话：\u201c老婆，我已到深圳了，你晚饭吃了没？别吃辛辣油腻的啊，有没有一点点想我呀？\u2026\u2026\u201d 
     * 我：\u201c外面没有下雨，你有三条内裤晾在阳台上，两件花的一件红的，电饭锅里有4个玉米棒子，三个熟的一个生的，家里还有哪些地方需要看一下的？\u201d 
     * 老公：\u201c哦，在家就好。\u201d\u2026\u2026","title":"在家就好","type":1,"ct":"2018-02-12 09:30:02.661"},
     * {"text":"昨天去超市买鱼，跟卖鱼的小哥侃了会儿后，只见他熟练的捞鱼、杀鱼、打包，那手法、那过程、专业啊，拿过鱼，我始终觉着那里不对弱弱的看着小哥，小哥也疑惑的看着我，眼神迅速的从疑惑变成无比纠结，爆了句：艹，忘先称重了。","title":"买鱼","type":1,"ct":"2018-02-12 09:30:02.626"},{"text":"一位大哥出狱，他当初是因为走私罪被抓，在里面死活不肯说最后一批货藏在哪里，结果重判了20年。接出狱之后大哥一言不发让朋友开车到郊区，仔细辨认了很久才找到了当初埋货的地方。他们挖半天挖出了一个特大号大箱子。大哥看着大箱子全身都颤抖了，紧紧抓着我的手说：这批货一出手我们就有钱了，这几年的苦也没白受，以后就能有好日子过了！我俩流着幸福的泪水打开箱子，满满地全是崭新摩托罗拉BB机。。。。","title":"走私","type":1,"ct":"2018-02-12 09:30:02.625"},{"text":"相亲时，对她第一印象并不是太深刻。将就着请她吃第一顿饭时，谈吐间也没碰撞出火花。然而！当我垂头丧气的去给饭店老板结账时。当我下意识的一次回眸时。当我看到她不知什么时候，给服务员要了个馒头，沾着盘底往嘴里塞时。我突然冒出一个决定。这辈子，就她了！好养！","title":"好养","type":1,"ct":"2018-02-12 09:30:02.620"},{"text":"今天去商场购物，刚把车停下，就有人喊我：\u201c王丽婷！\u201d我很惊讶问道：\u201c师傅你怎么知道我的名字啊？\u201d\r\n师傅道：\u201c谁知道你名字？我TM是让你把车往里停！\u201d","title":"今天去商场购物，刚把...","type":1,"ct":"2018-02-12 09:07:53.680"},{"text":"记得以前高中时候，宿舍就我一个人有洗发水，老是被人偷偷用，还抓不着人。\r\n忍无可忍的我把剩下半瓶洗发水倒了，买来一瓶脱毛膏兑了进去。\r\n没过几个几天，宿舍除了我以外都成了秃子。后来我就因全身骨折住院了。","title":"记得以前高中时候，宿...","type":1,"ct":"2018-02-12 08:30:03.246"},{"text":"为什么经常看见妻子吊打小三，却很少看见丈夫痛殴奸夫？\r\n因为小三一般比妻子懦弱，而奸夫一般比丈夫健硕！","title":"为什么经常看见妻子吊...","type":1,"ct":"2018-02-12 08:00:03.056"},{"text":"白天憋了个屁到晚上睡觉时才放，原以为被窝会暖和点儿，没想到把两团被子都掀翻到地上。","title":"白天憋了个屁到晚上睡...","type":1,"ct":"2018-02-12 08:00:03.055"},{"text":"今天中午吃饭发现我妈妈剪了头发，真心不好看。于是说：\u201c妈，你剪的头发真不好看，重找个地方剪吧\u2026\u2026\u201d\r\n老爸看看我，说：\u201c喂，请你不要随便评价我老婆，她又不跟你过日子\u2026\u2026\u201d","title":"今天中午吃饭发现我妈...","type":1,"ct":"2018-02-12 07:30:02.461"},{"text":"老师：小明告诉我唐宋八大家都是谁。<br />\r\n小明：老师老师，我知道，都有：汉钟离、张果老、韩湘子、铁拐李、吕洞宾、何仙姑、蓝采和及曹国舅。<br />\r\n老师：小明滚出去","title":"小明告诉我唐宋八大家都是谁","type":1,"ct":"2018-02-11 17:00:02.879"},{"text":"晚上，我喝醉回家，老婆对我大吵大闹<br />\r\n<br />\r\n我当时就急了:闭嘴，你也是上过大学的人，干什么大吵大闹的，有点素质好不好，有什么事不能等我跪下再说！","title":"我喝醉回家，老婆对我大吵大闹","type":1,"ct":"2018-02-11 17:00:02.879"},{"text":"五岁的女儿举着一根手指对妈妈说：\u201c妈妈你看！\u201d妈妈一口咬住她的手指头说：\u201c啊呜，我是老虎！\u201d小女孩拿出手指，疑惑地问：\u201c咦，妈妈，我的鼻屎呢？\u201d ","title":"五岁的女儿举着一根手指对妈妈说","type":1,"ct":"2018-02-11 17:00:02.877"},{"text":"我下班回家，刚推开门，老婆一伸腿，把我绊倒在地，我摔了一跤，我爬起来，怒问老婆：\u201c你\u2026\u2026你这是干什么？\u201d<br />\r\n老婆：\u201c儿子让我这么干的！\u201d<br />\r\n我啪啪给儿子一巴掌：\u201c小兔崽子，你敢让你妈把我绊倒！  \u201d<br />\r\n儿子一脸委屈：\u201c我给妈妈说，我想看《摔跤吧，爸爸》\u201d<br />\r\n我：\u201c\u2026\u2026\u201d","title":"我下班回家","type":1,"ct":"2018-02-11 17:00:02.877"},{"text":"女儿见妈妈涂口红，问：\u201c妈妈，你为什么要涂口红呀?\u201d妈妈听后说：\u201c涂上口红漂亮!\u201d女儿听后思考了一下说：\u201c爸爸那么丑，怎么不给他涂点呢?\u201d","title":"女儿见妈妈涂口红","type":1,"ct":"2018-02-11 17:00:02.874"}],"currentPage":1,"allNum":8738,"maxResult":20}
     */

    private String showapi_res_error;
    private int showapi_res_code;
    private ShowapiResBodyBean showapi_res_body;

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * allPages : 437
         * ret_code : 0
         * contentlist : [{"text":"悟空打死了白骨精，使出现出原型\u2014\u2014一堆白骨！\r\n八戒见了，忙上去狠狠地补刀，铸了一钯又一钯。\r\n悟空见了：八戒，她跟你有仇？\r\n
         * 八戒：没有！可凭什么大家都是妖怪，她就可以瘦得剩下骨头，我却要这么胖！！\r\n","title":"悟空打死了白骨精，使...","type":1,"ct":"2018-02-12 10:00:03
         * .257"},{"text":"玩网游认识的她，苍白清秀的小脸我见犹怜。于是我帮了她几次，没想到她就赖上我了，升级我带，装备我提供。一次我问她:\u201c你欠我这么多怎么还呀？\u201d，她说:\u201c
         * 嫁给你呗！\u201d有一天她消失了，半个月后我找到她家，望着墓碑上的小脸，说:\u201c小骗子，你答应嫁给我的啊！\u201d后来听她朋友说，\u201c他为了你去泰国做手术，却没挺过来。\u201d",
         * "title":"却没挺过来","type":1,"ct":"2018-02-12 10:00:03.074"},
         * {"text":"上语文课时，老师听写，当写到狼狈为奸时，我不会写\u201c狈\u201d字，于是瞄了一眼同桌的，他写的是狼被围奸。","title":"狼狈为奸","type":1,
         * "ct":"2018-02-12 10:00:03.072"},
         * {"text":"回家就被催婚，相亲十几次无果。在我感觉生命中已经没有盼头的时候，白马王子出现了，俩人一见如故，聊得不亦乐乎。后来去他家，连上wifi
         * 我假装不懂让他帮我下载一个手游，他让我自己下。我娇滴滴的说：人家不会下载嘛！\u201d话音刚落，他妈妈说：我家就这一个儿子，我还想着早点抱孙子呢！没想到，你\u2026\u2026你走吧！我求你了。\u201d
         * 还没说完呢噗通一声跪我面前","title":"下载","type":1,"ct":"2018-02-12 10:00:03.068"},
         * {"text":"餐馆吃饭，隔壁桌有俩老外。胖胖的老外看到墙上有一个倒着贴的\u2018福\u2019字不太理解。\r\n另一个头发卷卷的老外就跟他解释：\u201c折个字，在粽国是很流行的！\u201d\r\n
         * 胖胖老外一脸很佩服的表情听着，头发卷卷的老外很认真的接着说：\u201c折个，就叫做倒\u2018逼\u2019\u201d","title":"餐馆吃饭，隔壁桌有俩...","type":1,
         * "ct":"2018-02-12 09:30:02.854"},{"text":"第一次做饭，拍了几张照片，发了个朋友圈...结果被亲朋好友各种点赞，好评不断...只有老妈絮叨的留言道：\u201c
         * 别忘了关煤气...\u201d","title":"煤气","type":1,"ct":"2018-02-12 09:30:02.662"},
         * {"text":"老公打来电话：\u201c老婆，我已到深圳了，你晚饭吃了没？别吃辛辣油腻的啊，有没有一点点想我呀？\u2026\u2026\u201d 
         * 我：\u201c外面没有下雨，你有三条内裤晾在阳台上，两件花的一件红的，电饭锅里有4个玉米棒子，三个熟的一个生的，家里还有哪些地方需要看一下的？\u201d 
         * 老公：\u201c哦，在家就好。\u201d\u2026\u2026","title":"在家就好","type":1,"ct":"2018-02-12 09:30:02.661"},
         * {"text":"昨天去超市买鱼，跟卖鱼的小哥侃了会儿后，只见他熟练的捞鱼、杀鱼、打包，那手法、那过程、专业啊，拿过鱼，我始终觉着那里不对弱弱的看着小哥，小哥也疑惑的看着我，眼神迅速的从疑惑变成无比纠结，爆了句：艹，忘先称重了。","title":"买鱼","type":1,"ct":"2018-02-12 09:30:02.626"},{"text":"一位大哥出狱，他当初是因为走私罪被抓，在里面死活不肯说最后一批货藏在哪里，结果重判了20年。接出狱之后大哥一言不发让朋友开车到郊区，仔细辨认了很久才找到了当初埋货的地方。他们挖半天挖出了一个特大号大箱子。大哥看着大箱子全身都颤抖了，紧紧抓着我的手说：这批货一出手我们就有钱了，这几年的苦也没白受，以后就能有好日子过了！我俩流着幸福的泪水打开箱子，满满地全是崭新摩托罗拉BB机。。。。","title":"走私","type":1,"ct":"2018-02-12 09:30:02.625"},{"text":"相亲时，对她第一印象并不是太深刻。将就着请她吃第一顿饭时，谈吐间也没碰撞出火花。然而！当我垂头丧气的去给饭店老板结账时。当我下意识的一次回眸时。当我看到她不知什么时候，给服务员要了个馒头，沾着盘底往嘴里塞时。我突然冒出一个决定。这辈子，就她了！好养！","title":"好养","type":1,"ct":"2018-02-12 09:30:02.620"},{"text":"今天去商场购物，刚把车停下，就有人喊我：\u201c王丽婷！\u201d我很惊讶问道：\u201c师傅你怎么知道我的名字啊？\u201d\r\n师傅道：\u201c谁知道你名字？我TM是让你把车往里停！\u201d","title":"今天去商场购物，刚把...","type":1,"ct":"2018-02-12 09:07:53.680"},{"text":"记得以前高中时候，宿舍就我一个人有洗发水，老是被人偷偷用，还抓不着人。\r\n忍无可忍的我把剩下半瓶洗发水倒了，买来一瓶脱毛膏兑了进去。\r\n没过几个几天，宿舍除了我以外都成了秃子。后来我就因全身骨折住院了。","title":"记得以前高中时候，宿...","type":1,"ct":"2018-02-12 08:30:03.246"},{"text":"为什么经常看见妻子吊打小三，却很少看见丈夫痛殴奸夫？\r\n因为小三一般比妻子懦弱，而奸夫一般比丈夫健硕！","title":"为什么经常看见妻子吊...","type":1,"ct":"2018-02-12 08:00:03.056"},{"text":"白天憋了个屁到晚上睡觉时才放，原以为被窝会暖和点儿，没想到把两团被子都掀翻到地上。","title":"白天憋了个屁到晚上睡...","type":1,"ct":"2018-02-12 08:00:03.055"},{"text":"今天中午吃饭发现我妈妈剪了头发，真心不好看。于是说：\u201c妈，你剪的头发真不好看，重找个地方剪吧\u2026\u2026\u201d\r\n老爸看看我，说：\u201c喂，请你不要随便评价我老婆，她又不跟你过日子\u2026\u2026\u201d","title":"今天中午吃饭发现我妈...","type":1,"ct":"2018-02-12 07:30:02.461"},{"text":"老师：小明告诉我唐宋八大家都是谁。<br />\r\n小明：老师老师，我知道，都有：汉钟离、张果老、韩湘子、铁拐李、吕洞宾、何仙姑、蓝采和及曹国舅。<br />\r\n老师：小明滚出去","title":"小明告诉我唐宋八大家都是谁","type":1,"ct":"2018-02-11 17:00:02.879"},{"text":"晚上，我喝醉回家，老婆对我大吵大闹<br />\r\n<br />\r\n我当时就急了:闭嘴，你也是上过大学的人，干什么大吵大闹的，有点素质好不好，有什么事不能等我跪下再说！","title":"我喝醉回家，老婆对我大吵大闹","type":1,"ct":"2018-02-11 17:00:02.879"},{"text":"五岁的女儿举着一根手指对妈妈说：\u201c妈妈你看！\u201d妈妈一口咬住她的手指头说：\u201c啊呜，我是老虎！\u201d小女孩拿出手指，疑惑地问：\u201c咦，妈妈，我的鼻屎呢？\u201d ","title":"五岁的女儿举着一根手指对妈妈说","type":1,"ct":"2018-02-11 17:00:02.877"},{"text":"我下班回家，刚推开门，老婆一伸腿，把我绊倒在地，我摔了一跤，我爬起来，怒问老婆：\u201c你\u2026\u2026你这是干什么？\u201d<br />\r\n老婆：\u201c儿子让我这么干的！\u201d<br />\r\n我啪啪给儿子一巴掌：\u201c小兔崽子，你敢让你妈把我绊倒！  \u201d<br />\r\n儿子一脸委屈：\u201c我给妈妈说，我想看《摔跤吧，爸爸》\u201d<br />\r\n我：\u201c\u2026\u2026\u201d","title":"我下班回家","type":1,"ct":"2018-02-11 17:00:02.877"},{"text":"女儿见妈妈涂口红，问：\u201c妈妈，你为什么要涂口红呀?\u201d妈妈听后说：\u201c涂上口红漂亮!\u201d女儿听后思考了一下说：\u201c爸爸那么丑，怎么不给他涂点呢?\u201d","title":"女儿见妈妈涂口红","type":1,"ct":"2018-02-11 17:00:02.874"}]
         * currentPage : 1
         * allNum : 8738
         * maxResult : 20
         */

        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * text : 悟空打死了白骨精，使出现出原型——一堆白骨！
             八戒见了，忙上去狠狠地补刀，铸了一钯又一钯。
             悟空见了：八戒，她跟你有仇？
             八戒：没有！可凭什么大家都是妖怪，她就可以瘦得剩下骨头，我却要这么胖！！

             * title : 悟空打死了白骨精，使...
             * type : 1
             * ct : 2018-02-12 10:00:03.257
             */

            private String text;
            private String title;
            private int type;
            private String ct;

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }
}//jhfghfh